Revit 2027 API
BuiltInFailures.RoomFailures.ExtensionsOverlapWarning Property
 Vertical Extensions on these Walls overlap. This can cause undesirable Joins. Try starting with no overlap and extend the Walls toward one another.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ExtensionsOverlapWarning { get; }
Public Shared ReadOnly Property ExtensionsOverlapWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ExtensionsOverlapWarning {
	FailureDefinitionId^ get ();
}
static member ExtensionsOverlapWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace